artillery/config.yaml
config:
  target: "https://rppmjvu8ei.execute-api.us-east-1.amazonaws.com"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios:
  # We define one scenario:
  - name: "Purchase"
    flow:
      - post:
          url: "/Prod/"
          body: '{"DeviceID":"device123","CustomerID":"customer123","EventID":"event123"}'
          # The endpoint responds with JSON, which we parse and extract a field from
          # to use in the next request:
          capture:
            json: "$.results[0].ticketID"
            as: "id"